{
  "SUTD's Design-Centric Curriculum and Pedagogy": [
    "How does SUTD's design-centric curriculum integrate humanities and social sciences to inform the design process, and what specific courses are offered to fulfill this?",
    "Can you elaborate on the 'Design Thinking' methodology taught at SUTD, including specific tools and techniques used, and how it differs from other universities' approaches?",
    "What opportunities exist for interdisciplinary collaboration between different pillars (e.g., Engineering, Architecture, Computer Science) within the design curriculum, and how are these collaborations facilitated and assessed?",
    "How does SUTD's pedagogy incorporate hands-on learning experiences like prototyping, workshops, and studio-based projects, and what resources (e.g., labs, equipment) are available to students?",
    "What kind of industry partnerships does SUTD have that directly impact the design curriculum, such as sponsored projects, guest lectures, or internship opportunities, and how do these benefit students?",
    "How is sustainability integrated into the design curriculum at SUTD, and what specific projects or courses address environmental and social responsibility in design?",
    "What are the key differences in the design curriculum and pedagogy between the Freshmore year and subsequent pillars, and how does the Freshmore year prepare students for specialized design work?",
    "How does SUTD assess student learning in the design-centric curriculum, and what emphasis is placed on the process of design versus the final product or outcome?",
    "Beyond technical skills, how does SUTD's design-centric education foster soft skills like communication, teamwork, and critical thinking, and what specific initiatives are in place to develop these skills?",
    "In your opinion, what are the biggest strengths and weaknesses of SUTD's design-centric curriculum and pedagogy compared to other top design schools globally, and what improvements are being considered for the future?"
  ],
  "The 5 Pillars of SUTD's Academic Programs": [
    "Could you elaborate on how the 'Design' pillar is integrated across all SUTD majors, even those seemingly unrelated to traditional design fields like computer science or engineering, with specific examples?",
    "Beyond the stated curriculum, how does SUTD foster a culture of 'Innovation' within its students, and what resources are available to support student-led innovative projects and ventures?",
    "The 'Technology' pillar is broad. Can you provide examples of specific cutting-edge technologies that SUTD faculty are actively researching and teaching, and how students gain hands-on experience with them?",
    "How does SUTD ensure the 'Leadership' pillar is developed not just through formal coursework but also through extracurricular activities and mentorship opportunities, and what are some examples of successful student leadership initiatives?",
    "Regarding the 'Entrepreneurship' pillar, what specific support and funding opportunities are available for SUTD students who wish to launch their own startups, and what is SUTD's track record in terms of student startup success?",
    "How does the emphasis on the 5 pillars differentiate the SUTD learning experience from other universities with similar academic programs, and what are the perceived advantages for graduates in the job market?",
    "Can you provide more detail on the assessment methods used to evaluate student understanding and application of the 5 pillars, particularly in interdisciplinary projects?",
    "How is the curriculum related to the 5 pillars updated to reflect the latest advancements in technology, design, and societal needs, and what role do students play in providing feedback on the curriculum?",
    "What are some examples of capstone projects or research opportunities that directly address and integrate all 5 pillars, and what are the outcomes of these projects in terms of real-world impact?",
    "In your opinion, which of the 5 pillars is the most challenging for students to grasp and integrate into their work, and what support systems are in place to help students overcome these challenges?"
  ],
  "SUTD's Undergraduate Degree Programs: A Detailed Overview": [
    "Beyond the official curriculum, what opportunities are available for undergraduate students to pursue independent research projects or participate in faculty-led research initiatives, and how competitive is the application process for these?",
    "Could you elaborate on the specific differences in career prospects and industry connections for graduates from each of the four pillars (Architecture and Sustainable Design, Engineering Product Development, Engineering Systems and Design, and Information Systems Technology and Design), providing examples of companies that actively recruit from each pillar?",
    "How does SUTD integrate design thinking and a hands-on approach across all undergraduate programs, even those that might seem more theoretical, and can you provide concrete examples of projects or assignments that showcase this?",
    "What kind of support and resources are available for students who are considering starting their own companies or pursuing entrepreneurial ventures during or after their undergraduate studies at SUTD, including access to mentorship, funding, and prototyping facilities?",
    "SUTD emphasizes interdisciplinary collaboration. Can you describe a specific interdisciplinary project that undergraduate students from different pillars have worked on together, outlining the challenges they faced and the outcomes achieved?",
    "What is the typical class size for core undergraduate courses, and what measures does SUTD take to ensure that students receive personalized attention and support from faculty members?",
    "How does SUTD prepare students for the rapidly evolving technological landscape, and what specific skills or competencies are emphasized to ensure that graduates remain relevant and competitive in the job market in the long term?",
    "What are the opportunities for undergraduate students to participate in international exchange programs or internships, and which universities or companies does SUTD have partnerships with for these programs?",
    "In your opinion, what are the top three unique advantages of pursuing an undergraduate degree at SUTD compared to other leading universities in Singapore or internationally, and how do these advantages translate into tangible benefits for students' future careers?",
    "Can you provide more information about the financial aid and scholarship opportunities available for undergraduate students, including eligibility criteria, application deadlines, and the average amount of financial assistance provided?"
  ],
  "Research Opportunities for Undergraduate Students at SUTD": [
    "What specific research areas are most accessible to undergraduate students, and are there any departments known for actively involving undergraduates in their research projects?",
    "Could you elaborate on the UROP (Undergraduate Research Opportunities Programme) at SUTD? What are the eligibility criteria, application process, and typical time commitment required, and how competitive is it to get accepted?",
    "Are there opportunities for undergraduate students to co-author research papers or present at conferences based on their research contributions, and what support does SUTD provide for students pursuing these avenues?",
    "Besides UROP, what alternative pathways exist for undergraduate students to get involved in research, such as through independent study modules, faculty-led projects, or collaborations with external research institutions?",
    "How does SUTD ensure that undergraduate research experiences are meaningful and contribute to students' learning and development, rather than just being menial tasks assigned by researchers?",
    "What resources (e.g., funding, equipment, mentorship) are available to undergraduate students participating in research, and how can students access these resources?",
    "Could you provide some examples of successful undergraduate research projects at SUTD that have led to significant outcomes, such as publications, patents, or startups?",
    "How does SUTD support students who wish to continue their research after graduation, such as by providing opportunities for graduate studies or connecting them with potential employers in research-related fields?",
    "In your opinion, what are the key benefits of participating in undergraduate research at SUTD, and how does it enhance a student's overall learning experience and career prospects?",
    "What are the differences in research opportunities available to students in different SUTD pillars (e.g., Engineering Product Development, Engineering Systems and Design, Architecture and Sustainable Design, Information Systems Technology and Design), and how can students explore research opportunities across different pillars?"
  ],
  "SUTD's Industry Connections and Internship Programs": [
    "What specific industries are SUTD's industry connections strongest in, and how does this align with the different pillars of study offered?",
    "Can you provide examples of recent internship projects undertaken by SUTD students at companies like Dyson, Grab, or Singtel, and what were the learning outcomes?",
    "What is the process for securing an internship through SUTD's network, and what kind of support (e.g., resume workshops, interview preparation) is provided to students?",
    "How does SUTD ensure that internships are meaningful and aligned with students' academic and career goals, rather than just being administrative tasks?",
    "What percentage of SUTD graduates receive job offers from the companies where they interned, and how does this compare to the overall graduate employment rate?",
    "Are there opportunities for international internships, and if so, what are the common destinations and associated costs (e.g., visa, accommodation)?",
    "Beyond internships, how does SUTD integrate industry projects and real-world problem-solving into the curriculum to prepare students for the workforce?",
    "How does SUTD leverage its industry connections to provide students with mentorship opportunities from experienced professionals in their field of interest?",
    "In your opinion, what makes SUTD's industry connections and internship programs stand out compared to those offered by other universities in Singapore?",
    "What are the key performance indicators (KPIs) used to measure the success of SUTD's industry connections and internship programs, and how are these KPIs used to improve the programs over time?"
  ],
  "Career Prospects and Graduate Outcomes for SUTD Graduates": [
    "What are the typical job titles and industries that SUTD graduates from each pillar (Architecture and Sustainable Design, Engineering Product Development, Engineering Systems and Design, Information Systems Technology and Design) enter within the first 3 years after graduation?",
    "Can you provide specific data on the average starting salary and salary progression of SUTD graduates compared to graduates from other local universities in similar disciplines, adjusted for factors like GPA and internship experience?",
    "What resources and programs does SUTD offer to help students develop career-relevant skills beyond the core curriculum, such as workshops on resume writing, interview skills, and networking events with industry professionals?",
    "How does SUTD's emphasis on design thinking and interdisciplinary collaboration translate into a competitive advantage for graduates in the job market, particularly in roles that require innovation and problem-solving?",
    "What is SUTD's track record in terms of graduate entrepreneurship? What support systems (e.g., incubation programs, mentorship) are available for students who aspire to start their own companies after graduation?",
    "Does SUTD have partnerships with specific companies or organizations that offer internships or job opportunities to students? If so, could you provide examples and details on the nature of these partnerships?",
    "How does SUTD prepare students for the evolving demands of the future workforce, considering trends like automation, AI, and the increasing importance of data literacy?",
    "What percentage of SUTD graduates pursue postgraduate studies (Masters or PhD) after graduation, and what are the most common fields of study and universities they attend?",
    "In your opinion, what are the key strengths of SUTD graduates that make them attractive to employers, and what are the areas where they might need further development to excel in their careers?",
    "Beyond salary and job title, how does SUTD measure and track the long-term career satisfaction and impact of its graduates in their respective fields?"
  ],
  "SUTD's Admission Requirements and Application Process": [
    "What is the typical academic profile (GPA, IB score, Polytechnic GPA) of successful applicants to SUTD's undergraduate programs, and how does SUTD weigh different academic qualifications (e.g., A-Levels vs. International Baccalaureate)?",
    "Beyond academic grades, what specific types of extracurricular activities, projects, or portfolios are highly valued by the SUTD admissions committee, particularly those demonstrating innovation, design thinking, or a passion for technology?",
    "Could you elaborate on the purpose and format of the SUTD admissions essay, and what key qualities or experiences should applicants highlight to differentiate themselves and demonstrate their suitability for SUTD's unique curriculum?",
    "How does SUTD assess applicants who have taken a gap year or have non-traditional academic backgrounds, and what advice would you give to these applicants to strengthen their application?",
    "What are the specific requirements and procedures for international students applying to SUTD, including visa requirements, English language proficiency tests (e.g., TOEFL, IELTS), and the recognition of foreign qualifications?",
    "Does SUTD offer any early admission or priority application schemes, and what are the eligibility criteria and potential benefits of applying through these options?",
    "What are the different stages of the application process, including deadlines, interview procedures (if any), and the timeline for receiving admission decisions?",
    "How does SUTD's admissions process differ for the various undergraduate programs (e.g., Architecture and Sustainable Design vs. Engineering Product Development), and are there specific prerequisites or portfolio requirements for certain programs?",
    "In your opinion, what are the most common mistakes applicants make in their SUTD application, and what advice would you give to avoid these pitfalls and maximize their chances of admission?",
    "What resources and support services does SUTD provide to prospective students during the application process, such as application workshops, online information sessions, or personalized advising?"
  ],
  "Scholarships and Financial Aid Options at SUTD": [
    "What specific academic achievements, extracurricular activities, or leadership experiences would significantly strengthen my application for the SUTD Merit Scholarship, beyond just meeting the minimum requirements?",
    "Besides the SUTD Undergraduate Scholarship, what other scholarships are available to international students, and what are their respective eligibility criteria and average award amounts?",
    "Could you provide a breakdown of the different types of financial aid available (e.g., bursaries, loans, grants) and how the application process differs for each?",
    "How does SUTD assess financial need when considering applications for bursaries or financial aid packages, and what documentation is typically required to demonstrate my family's financial situation?",
    "If I receive a scholarship that covers tuition fees but not living expenses, what are the estimated monthly living costs for a student in Singapore, and what resources are available to help students budget and manage their finances?",
    "Are there any scholarship or financial aid options specifically tailored to students pursuing certain specializations within SUTD's degree programs, such as Artificial Intelligence or Design and Artificial Intelligence?",
    "What is the typical timeline for scholarship application deadlines and notification of results, and how does this timeline align with the university's admission deadlines?",
    "In your opinion, what are the most common mistakes students make when applying for scholarships at SUTD, and how can I avoid them to maximize my chances of success?",
    "If I am unsuccessful in securing a scholarship during my first year, are there opportunities to apply for scholarships or financial aid in subsequent years based on my academic performance at SUTD?",
    "How does SUTD's financial aid office support students who face unexpected financial difficulties during their studies, and what are the procedures for seeking emergency financial assistance?"
  ],
  "SUTD's Tuition Fees and Cost of Living in Singapore": [
    "What are the exact tuition fees for international students in the Architecture and Sustainable Design (ASD) pillar for the academic year 2024-2025, and what is the annual percentage increase I should expect over the 4-year program?",
    "Beyond the stated tuition fees, are there any mandatory miscellaneous fees (e.g., student activity fees, lab fees, insurance) that are not covered by tuition and how much do these typically amount to per year?",
    "What financial aid options (scholarships, bursaries, loans) are available specifically for international students from Southeast Asia, and what are the eligibility criteria and application deadlines for each?",
    "Can you provide a detailed breakdown of the estimated monthly cost of living for a student living in SUTD's on-campus housing, including expenses for food, transportation, textbooks, personal expenses, and social activities?",
    "How does the cost of living in Singapore, specifically around the SUTD campus, compare to other major cities in Asia (e.g., Hong Kong, Tokyo, Seoul), and what strategies can students employ to minimize their expenses?",
    "What are the on-campus and off-campus part-time job opportunities available to international students, and what is the average hourly wage they can expect to earn to help offset their living expenses?",
    "What are the payment options for tuition fees, and are there any discounts or incentives for paying tuition fees in full upfront or through specific payment methods?",
    "How competitive are SUTD's merit-based scholarships, and what specific academic achievements, extracurricular activities, or personal qualities are given the most weight during the selection process?",
    "In your opinion, considering the high cost of tuition and living in Singapore, is an SUTD education a worthwhile investment for students interested in design and technology fields, compared to similar programs in other countries with lower costs?",
    "Does SUTD have any partnerships with local businesses or organizations that offer internships or sponsorships to students, potentially leading to employment opportunities after graduation and helping to offset the cost of education in the long run?"
  ],
  "Student Housing and Residential Life at SUTD": [
    "What are the different room configurations available in the SUTD hostels (e.g., single, double, shared) and what are the approximate costs associated with each, including utilities?",
    "Can you describe the process for applying for student housing, including the timeline, eligibility criteria (beyond just being a full-time student), and factors that influence room assignment?",
    "What are the specific policies regarding overnight guests, including frequency limits, registration procedures, and potential consequences for non-compliance?",
    "Beyond the basic amenities (bed, desk, etc.), what are some of the less obvious facilities or resources available to residents, such as communal kitchens, study spaces, recreational equipment, or printing services?",
    "What is the role of the Residential Life team at SUTD? Can you provide specific examples of programs, activities, or support services they offer to foster community and student well-being?",
    "How does SUTD address safety and security within the hostels? What measures are in place to prevent theft, ensure emergency preparedness, and address student concerns about safety?",
    "What opportunities are there for student involvement in residential life, such as becoming a Residential Assistant (RA) or participating in hostel committees, and what are the benefits of these roles?",
    "How diverse is the student population within the hostels in terms of nationality, year of study, and academic major? How does SUTD promote intercultural understanding and inclusivity in residential life?",
    "In your opinion, what are the biggest advantages and disadvantages of living in SUTD student housing compared to renting an apartment off-campus, considering factors like cost, convenience, and social life?",
    "What support systems are in place for students who may be experiencing difficulties adjusting to hostel life, such as homesickness, interpersonal conflicts, or academic stress? Are there specific counselors or resources available within the residential community?"
  ],
  "Student Clubs and Organizations at SUTD": [
    "Could you provide a comprehensive list of all officially recognized student clubs and organizations at SUTD, categorized by their primary focus areas (e.g., technology, arts, sports, social impact)?",
    "What resources and support does SUTD provide to student clubs and organizations, including funding opportunities, mentorship programs, and access to facilities or equipment?",
    "How does SUTD encourage student involvement in clubs and organizations, and what percentage of the student body actively participates in at least one club?",
    "Can you describe the process for starting a new student club or organization at SUTD, including the requirements for recognition and the level of administrative support available?",
    "What are some of the most popular and active student clubs at SUTD, and what notable achievements or events have they organized in the past year?",
    "How do student clubs and organizations at SUTD contribute to the overall student experience and campus culture, and what opportunities do they provide for leadership development and networking?",
    "Are there any specific student clubs or organizations at SUTD that focus on promoting diversity and inclusion, and what initiatives do they undertake to create a more welcoming and equitable campus environment?",
    "What is the typical time commitment required for active participation in a student club or organization at SUTD, and how do students balance their academic workload with extracurricular activities?",
    "In your opinion, what are the unique strengths and weaknesses of the student club and organization scene at SUTD compared to other universities, and what improvements could be made?",
    "How do student clubs and organizations at SUTD connect with industry partners or external organizations, and what opportunities do they provide for students to gain practical experience or professional development?"
  ],
  "SUTD's Campus Facilities and Resources": [
    "Could you provide a detailed overview of the makerspaces available to students, including the types of equipment available (e.g., 3D printers, laser cutters, CNC machines), access policies, and any associated training programs or workshops?",
    "What are the library resources like at SUTD? Specifically, what digital databases and online journals are accessible to students, and are there interlibrary loan programs with other Singaporean universities?",
    "Beyond the academic facilities, what recreational and sports facilities are available on campus, including gyms, sports courts, swimming pools, and student clubs related to sports and fitness?",
    "How accessible are the campus facilities for students with disabilities? Are there ramps, elevators, accessible restrooms, and assistive technology available in classrooms and labs?",
    "What types of on-campus housing options are available to students, and what are the key differences in terms of cost, amenities, and community atmosphere between these options?",
    "What kind of food and beverage options are available on campus, including the price range and variety of cuisines offered? Are there healthy food options readily available, and are there accommodations for students with dietary restrictions?",
    "How does SUTD support student well-being through its campus facilities and resources? Are there counseling services, health clinics, or dedicated spaces for relaxation and mindfulness?",
    "What are the opening hours and accessibility of different campus facilities (e.g., library, labs, makerspaces) during weekends, holidays, and examination periods?",
    "In your opinion, what is the most unique or valuable campus facility or resource that SUTD offers, and how does it contribute to the overall student experience and learning environment?",
    "How does SUTD ensure the safety and security of its campus facilities, including security personnel, CCTV surveillance, and emergency response protocols? What resources are available for students who feel unsafe or require assistance?"
  ],
  "SUTD's Global Opportunities Program (e.g., exchange programs)": [
    "Could you provide a breakdown of the partner universities SUTD collaborates with for exchange programs, specifically highlighting those strong in design-related fields and the typical duration of the exchange at each?",
    "Beyond academic coursework, what opportunities exist within the Global Opportunities Program (GOP) for students to engage in research collaborations, internships, or design projects at partner institutions?",
    "What are the specific eligibility requirements for applying to the GOP, including minimum GPA, required courses, and any mandatory pre-departure training or workshops?",
    "How does SUTD support students financially during their exchange program, including scholarships, grants, and assistance with budgeting and cost-of-living considerations in different host countries?",
    "Can you describe the process for transferring credits earned abroad back to SUTD and how this impacts the overall graduation requirements for different SUTD degree programs?",
    "What kind of cultural immersion activities or language support is offered by SUTD or the partner universities to help students adjust to living and studying in a new environment?",
    "Are there specific exchange programs tailored for students in particular pillars (e.g., Engineering Product Development, Architecture and Sustainable Design), and if so, what are some examples?",
    "In your opinion, what are the biggest challenges students face when participating in the GOP, and what resources does SUTD provide to help them overcome these challenges?",
    "How competitive is the application process for the GOP, and what factors do the selection committee prioritize when evaluating candidates (e.g., academic performance, personal statement, extracurricular involvement)?",
    "Considering the evolving global landscape and travel restrictions, how has SUTD adapted its GOP to ensure student safety and well-being while still providing meaningful international experiences (e.g., virtual exchange programs, shorter-term programs)?"
  ],
  "The SUTD-MIT International Design Centre (IDC)": [
    "What specific research areas are currently being prioritized at the SUTD-MIT IDC, and how does this align with Singapore's national research and development priorities?",
    "Could you elaborate on the opportunities for undergraduate students to participate in IDC research projects, and what level of commitment is typically expected?",
    "How does the SUTD-MIT IDC facilitate collaboration between researchers from different disciplines (e.g., engineering, architecture, humanities) to address complex design challenges?",
    "What kind of specialized equipment and facilities are available at the IDC for researchers, and how does this compare to other research institutions in Singapore?",
    "Can you provide examples of successful projects that have emerged from the IDC, highlighting the impact they have had on industry or society?",
    "How does the IDC support the commercialization of research findings and the creation of spin-off companies?",
    "What are the key differences in the research focus and approach between the SUTD-MIT IDC and other design-focused research centers globally?",
    "How does the IDC foster a culture of innovation and entrepreneurship among its researchers and students?",
    "What are the main funding sources for the IDC, and how does this impact the types of research projects that are pursued?",
    "In your opinion, what are the biggest challenges and opportunities facing the SUTD-MIT IDC in the next 5-10 years, and how is the center preparing to address them?"
  ],
  "SUTD's Focus on Sustainability and Innovation": [
    "Could you elaborate on the specific ways SUTD integrates sustainable design principles into its core curriculum across all pillars, and not just in dedicated sustainability-focused courses?",
    "What specific research initiatives or projects are currently underway at SUTD that directly address pressing sustainability challenges in Singapore and the broader Southeast Asian region?",
    "How does SUTD foster interdisciplinary collaboration between different pillars (e.g., Engineering Product Development, Architecture and Sustainable Design) to develop innovative and sustainable solutions?",
    "Beyond the curriculum, what opportunities are available for students to engage in extracurricular activities, clubs, or competitions that promote sustainability and innovation?",
    "Can you provide examples of SUTD alumni who have successfully launched startups or pursued careers focused on sustainability and innovation, and what skills or experiences at SUTD contributed to their success?",
    "How does SUTD's collaboration with industry partners contribute to the development of sustainable technologies and practices, and are there opportunities for students to participate in these collaborations through internships or research projects?",
    "What are SUTD's own sustainability goals and initiatives as a university, such as reducing its carbon footprint or promoting sustainable campus operations, and how does it measure its progress towards these goals?",
    "How does SUTD's design-centric approach specifically encourage innovative solutions to sustainability challenges, as opposed to solely relying on technological advancements?",
    "What are the key challenges SUTD faces in promoting sustainability and innovation within its curriculum and research, and what strategies are being implemented to overcome these challenges?",
    "In your opinion, what makes SUTD's approach to sustainability and innovation unique compared to other universities in Singapore and internationally, and why should a student choose SUTD if they are passionate about these areas?"
  ],
  "SUTD's Capstone Project and Design Thinking Approach": [
    "Could you provide specific examples of past Capstone projects that have successfully addressed real-world problems, detailing the problem, the design solution, and the impact achieved?",
    "How does SUTD's Design Thinking approach specifically differ from other universities' design thinking methodologies, and what unique frameworks or tools do SUTD students utilize?",
    "What resources (e.g., funding, prototyping labs, mentorship) are available to Capstone project teams, and how competitive is it to secure these resources?",
    "How is the Capstone project integrated into the curriculum across different pillars (e.g., Engineering Product Development, Architecture and Sustainable Design), and are there interdisciplinary Capstone project opportunities?",
    "What are the assessment criteria for Capstone projects, and what emphasis is placed on the design process versus the final product or prototype?",
    "How does SUTD facilitate collaboration with industry partners on Capstone projects, and what are the potential benefits and challenges of such collaborations for students?",
    "Beyond technical skills, what soft skills (e.g., teamwork, communication, problem-solving) are emphasized and developed through the Capstone project and Design Thinking process?",
    "How does the Design Thinking approach taught at SUTD prepare students for entrepreneurial ventures or innovation roles in established companies after graduation?",
    "What opportunities are there for students to showcase their Capstone projects to potential employers or investors, and what support does SUTD provide in this regard?",
    "In your opinion, what is the most significant advantage of SUTD's Capstone project and Design Thinking approach compared to similar programs at other leading universities, and what are the potential areas for improvement?"
  ],
  "SUTD's Culture of Collaboration and Interdisciplinary Learning": [
    "Could you provide specific examples of interdisciplinary projects that students from different pillars (e.g., Engineering Systems and Design, Architecture and Sustainable Design) have collaborated on, and what were the learning outcomes for each discipline?",
    "How is collaboration assessed in project-based courses? Are there specific rubrics or guidelines that evaluate teamwork, communication, and individual contributions within a collaborative setting?",
    "Beyond formal projects, what informal opportunities exist for students from different pillars to interact and collaborate, such as student clubs, hackathons, or workshops?",
    "How does SUTD foster a culture of psychological safety and encourage students to take risks and share ideas openly within interdisciplinary teams, especially when facing differing perspectives?",
    "What support systems are in place to help students navigate the challenges of working in diverse teams, such as conflict resolution workshops or mentorship programs for interdisciplinary collaboration?",
    "Can you describe the faculty's role in promoting interdisciplinary learning? Are professors actively involved in co-teaching courses or mentoring interdisciplinary student teams?",
    "How does SUTD ensure that students develop a strong foundation in their chosen pillar while also gaining sufficient exposure to other disciplines to facilitate effective collaboration?",
    "What are some of the most significant successes and challenges SUTD has faced in implementing its collaborative and interdisciplinary learning model, and what lessons have been learned?",
    "In your opinion, how does SUTD's emphasis on collaboration and interdisciplinary learning differentiate it from other universities with similar programs, and what advantages does this provide to graduates in the job market?",
    "How does SUTD adapt its collaborative and interdisciplinary learning approaches to reflect the evolving needs of industries and address emerging global challenges?"
  ],
  "The SUTD Alumni Network and its Benefits": [
    "What specific industries and companies are SUTD alumni typically employed in, and can you provide data on average starting salaries broken down by major?",
    "Beyond networking events, what formal mentorship programs or opportunities does the SUTD alumni network offer to current students, and how are mentors selected and matched?",
    "How does the SUTD alumni network support entrepreneurial ventures of recent graduates, such as providing seed funding, access to investors, or business development resources?",
    "Can you provide examples of successful collaborations or partnerships that have emerged directly as a result of connections made within the SUTD alumni network?",
    "What are the different levels of engagement within the SUTD alumni network (e.g., active participation in events vs. passive membership), and how does the level of engagement impact the benefits received?",
    "How does SUTD leverage its alumni network to influence curriculum development and ensure that the skills taught are relevant to current industry demands?",
    "What online platforms or databases are available to connect with SUTD alumni, and how user-friendly and accessible are these resources for international students?",
    "In your opinion, what is the single most valuable benefit that the SUTD alumni network offers compared to alumni networks of other top universities in Singapore?",
    "How does the SUTD alumni network support graduates who are looking to transition into different career paths or industries after gaining initial work experience?",
    "What initiatives are in place to foster a sense of community and belonging within the SUTD alumni network, particularly for alumni living and working outside of Singapore?"
  ],
  "SUTD's Location and Accessibility": [
    "How frequent and reliable are the public transportation options (MRT, buses) connecting SUTD to major residential areas like Jurong, Tampines, and Yishun, especially during peak hours and late evenings?",
    "What is the average commute time from different parts of Singapore (e.g., Woodlands, Punggol, Queenstown) to SUTD using public transport, and are there any less congested routes or alternative modes of transport to consider?",
    "Are there dedicated bicycle lanes or sheltered walkways connecting SUTD to nearby MRT stations and residential areas to encourage cycling and walking, and what are the university's initiatives to promote sustainable commuting?",
    "How accessible is SUTD for students with disabilities, considering factors like wheelchair accessibility on campus, availability of accessible transportation options, and support services for students with mobility challenges?",
    "What are the parking facilities like at SUTD for students who drive, including the availability of parking spaces, parking fees, and the feasibility of obtaining a parking permit?",
    "Are there any shuttle bus services provided by SUTD connecting the campus to nearby MRT stations or residential areas, and what are the timings and routes of these shuttle services?",
    "How safe is the area surrounding SUTD, especially during late evenings and weekends, in terms of crime rate and security measures, and are there any security patrols or emergency services available?",
    "Beyond transportation, how convenient is the location of SUTD in terms of access to essential amenities like supermarkets, convenience stores, food options, and healthcare facilities?",
    "In your opinion, how does SUTD's location contribute to or detract from the overall student experience, considering factors like social life, recreational activities, and access to cultural attractions in Singapore?",
    "Are there any planned or proposed infrastructure developments in the vicinity of SUTD (e.g., new MRT lines, bus routes, or residential projects) that could potentially impact the accessibility or convenience of the university in the future?"
  ],
  "Comparing SUTD to Other Universities: What Makes SUTD Unique?": [
    "Beyond the stated design-centric curriculum, how does SUTD's teaching pedagogy (e.g., studio-based learning, project-based learning) tangibly differ in its execution and assessment from similar approaches used in engineering or architecture programs at NUS or NTU?",
    "SUTD emphasizes interdisciplinary collaboration. Can you provide specific examples of successful student projects or research initiatives that demonstrably benefited from the integration of multiple SUTD pillars (e.g., Engineering Systems Design, Architecture and Sustainable Design, Information Systems Technology and Design)? How is this integration facilitated and assessed?",
    "Compared to universities with established research strengths in specific engineering fields (e.g., electrical engineering at NUS, mechanical engineering at NTU), what are SUTD's key research areas where it possesses a competitive advantage or distinctive niche, and how does this impact undergraduate research opportunities?",
    "Given SUTD's relatively smaller student population compared to NUS and NTU, how does this impact the availability and diversity of student clubs, extracurricular activities, and overall campus life experience? Are there specific initiatives to compensate for the smaller size and ensure a vibrant student community?",
    "SUTD has a strong focus on technology and design. How does SUTD's career services and industry connections specifically cater to students seeking roles that require both technical expertise and design thinking skills, compared to the more traditional career pathways emphasized by other universities?",
    "What specific measures are in place to foster a culture of innovation and entrepreneurship at SUTD, and how do these differ from the entrepreneurial ecosystems offered at other Singaporean universities? Can you provide examples of successful startups or ventures that originated from SUTD?",
    "SUTD's curriculum is designed to be forward-looking. How does the university proactively adapt its curriculum and research focus to address emerging technological trends and societal challenges, such as artificial intelligence, sustainable development, and cybersecurity, compared to the curriculum update processes at other universities?",
    "What are the key advantages and disadvantages of SUTD's cohort-based learning system, especially for students who may have diverse learning styles or academic backgrounds, compared to the more individualistic learning environments at other universities?",
    "How does SUTD's international exposure and partnerships (e.g., with MIT, Zhejiang University) enhance the learning experience and career prospects for its students, and are there specific opportunities (e.g., exchange programs, joint research projects) that are uniquely accessible to SUTD students?",
    "In your opinion, what type of student thrives most at SUTD, and what are some common reasons why prospective students might ultimately choose a different university over SUTD, despite its unique offerings?"
  ]
}